{"chunk_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b-0", "doc_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b", "source": "wp-past-present-future-telecom-cloud.pdf", "file_name": "wp-past-present-future-telecom-cloud.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 0, "text": "BUSINESS WHITE PAPER\nThe Past, Present, \nand Future of the \nTelecom Cloud\nDelivering the Telecom Future Today with Pure Storage®", "meta": {"ingested_at": 1759756684, "relative_path": "wp-past-present-future-telecom-cloud.pdf"}}
{"chunk_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b-1", "doc_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b", "source": "wp-past-present-future-telecom-cloud.pdf", "file_name": "wp-past-present-future-telecom-cloud.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 1, "text": "BUSINESS WHITE PAPER The Past, Present, and Future of the Telecom Cloud Delivering the Telecom Future Today with Pure Storage® Uncomplicate Data Storage, Forever 2 BUSINESS WHITE PAPER Contents Introduction......................................................................................................................................................................................................3 The Telecom Cloud: The Past.......................................................................................................................................................................3 The Telecom Cloud: The Present.................................................................................................................................................................3 The Telecom Cloud: The Future...................................................................................................................................................................4 The Basic Present Cloud................................................................................................................................................................................4 Adding the Edge.....................................................................................................................................................................................5 The Present Telecom Cloud Powered by Pure Storage.....................................................................................................................5 The Future Cloud.............................................................................................................................................................................................6 The Future Telecom Cloud Powered by Pure Storage.......................................................................................................................6 Portworx Integration with Pure Storage Arrays..................................................................................................................................8", "meta": {"ingested_at": 1759756684, "relative_path": "wp-past-present-future-telecom-cloud.pdf"}}
{"chunk_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b-2", "doc_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b", "source": "wp-past-present-future-telecom-cloud.pdf", "file_name": "wp-past-present-future-telecom-cloud.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 2, "text": "The Present Telecom Cloud Powered by Pure Storage.....................................................................................................................5 The Future Cloud.............................................................................................................................................................................................6 The Future Telecom Cloud Powered by Pure Storage.......................................................................................................................6 Portworx Integration with Pure Storage Arrays..................................................................................................................................8 The Present Telecom Cloud Powered by Pure Storage.....................................................................................................................5 The Future Cloud.............................................................................................................................................................................................6 The Future Telecom Cloud Powered by Pure Storage.......................................................................................................................6 Portworx Integration with Pure Storage Arrays..................................................................................................................................8 Conclusion.......................................................................................................................................................................................................8 Additional Resources.....................................................................................................................................................................................8", "meta": {"ingested_at": 1759756684, "relative_path": "wp-past-present-future-telecom-cloud.pdf"}}
{"chunk_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b-3", "doc_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b", "source": "wp-past-present-future-telecom-cloud.pdf", "file_name": "wp-past-present-future-telecom-cloud.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 3, "text": "Cloud Powered by Pure Storage.....................................................................................................................5 The Future Cloud.............................................................................................................................................................................................6 The Future Telecom Cloud Powered by Pure Storage.......................................................................................................................6 Portworx Integration with Pure Storage Arrays..................................................................................................................................8 Conclusion.......................................................................................................................................................................................................8 Additional Resources.....................................................................................................................................................................................8 Uncomplicate Data Storage, Forever 3 BUSINESS WHITE PAPER Introduction Telecom providers have been in the forefront of network design and innovation for decades. In recent years, change has accelerated with the advent of network functions virtualization and the even more dramatic changes from cloud native network functions. In this white paper, we briefly examine the history of the telecom cloud, as well as the current state of the technology and where it’s heading. Finally, we present a vision of how the telecom cloud will evolve and how Pure Storage helps providers deliver on the robust potential of 5G, new edge revenue opportunities, Artificial Intelligence (AI), and Kubernetes-based service delivery. The Telecom Cloud: The Past For this discussion, we will fast-forward past the many decades of mechanical switching in telecom networks and begin our journey with the advent of digital telecom switching in the 1980s. Products, such as the Western Electric 5ESS and the Northern Telecom DMS family, revolutionized telecom networks and set the stage for today’s digital world. The original telecom “cloud” wasn’t a cloud as we think of it today: It was a network. But with the advent of dial-up services like Compuserve and Prodigy, we saw the start of a cloud-like experience with the telecom providing the pipe that enabled consumers to access shared data and communicate with other users. If you sat a present-day teenager in front of an old Compuserve interface, they would laugh at the crude graphics but would still find it an essentially familiar experience. The telecom architecture that serviced this original “cloud” was a collection of proprietary hardware with dozens of different systems, each performing a discrete function. It was costly and difficult to maintain, requiring an incredibly diverse range of equipment expertise, and took up football fields’ worth of rack space. Even with those challenges, it was remarkably resilient and effective. Yet,time was marching on. The Telecom Cloud: The Present While the telecom cloud of the past has a somewhat fuzzy timeline, the telecom cloud of the present has a clearly defined birthday: October 22, 2012. That was the date that a global team of telecom industry", "meta": {"ingested_at": 1759756684, "relative_path": "wp-past-present-future-telecom-cloud.pdf"}}
{"chunk_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b-4", "doc_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b", "source": "wp-past-present-future-telecom-cloud.pdf", "file_name": "wp-past-present-future-telecom-cloud.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 4, "text": "the telecom cloud of the present has a clearly defined birthday: October 22, 2012. That was the date that a global team of telecom industry the telecom cloud of the present has a clearly defined birthday: October 22, 2012. That was the date that a global team of telecom industry contributors published the white paper “Network Functions Virtualisation.” It was a revolutionary step. The big idea behind network functions virtualization (NFV) was to move the network functions that were being run on purpose- built hardware to virtual machines. This was made possible by the rise of VMware, KVM, and other hypervisors. The NFV concept said that any function running on a purpose-built device could also be run on commodity data center kit—servers, storage, and networking gear—via virtualization. A specific function using NFV is called a virtualized network function (VNF). There are multiple benefits to NFV, including reduced costs, less power consumption, and greater hardware portability. Most telecom providers have entered the world of the present cloud and are using VNFs (we’ll look at details shortly). But the future has already made itself known.", "meta": {"ingested_at": 1759756684, "relative_path": "wp-past-present-future-telecom-cloud.pdf"}}
{"chunk_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b-5", "doc_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b", "source": "wp-past-present-future-telecom-cloud.pdf", "file_name": "wp-past-present-future-telecom-cloud.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 5, "text": "have entered the world of the present cloud and are using VNFs (we’ll look at details shortly). But the future has already made itself known. Uncomplicate Data Storage, Forever 4 BUSINESS WHITE PAPER The Telecom Cloud: The Future The future cloud for telecom is already here and understood: It’s cloud-native network functions (CNFs). Going a step beyond NFV, CNFs exploit the extreme scalability and flexibility of containers and microservices orchestrated by Kubernetes. They bring all the benefits of NFV but have their own additional benefits, such as auto-scaling, a high level of fault tolerance, and rapid service restart. While CNFs are clearly the future direction for the telecom cloud, many carriers are struggling to deploy them effectively and at scale. Technology providers to telecoms will need to migrate their solutions to be truly cloud native. Just “containerizing” them will not be sufficient. Also, there is not necessarily a discrete separation of the present and future clouds. They co-exist with many carriers while they continue to support multiple generations—2G through 5G—of telecom infrastructure while also transitioning from present to future. Clouds are used to run a wide variety of telecom applications, such as billing systems, inventory, retail applications (e.g., new subscriber activation and point of sale systems), identity and fraud management, and more. The remainder of this paper looks at more details of how the present telecom cloud is deployed, and what is needed to get to the true future cloud. The Basic Present Cloud The basic present cloud may have only virtualized network functions, or it may have some containerization (CNFs) already mixed in. The cloud is data center-based and doesn’t include public cloud components. The below figure illustrates various components that form this cloud. Figure 1. The basic cloud is limited to the data center(s) and runs on physical infrastructure. Most carriers have moved beyond this, but it still comprises a significant portion of many clouds. The top layer is virtual storage provisioned for either VNFs or CNFs which are deployed via hypervisors that may be serving virtual machines or containers. KVM is currently the most widely used hypervisor for telecom and is typically used to run OpenStack. This cloud is deployed on the standard IT infrastructure of compute, storage, and networking.", "meta": {"ingested_at": 1759756684, "relative_path": "wp-past-present-future-telecom-cloud.pdf"}}
{"chunk_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b-6", "doc_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b", "source": "wp-past-present-future-telecom-cloud.pdf", "file_name": "wp-past-present-future-telecom-cloud.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 6, "text": "used hypervisor for telecom and is typically used to run OpenStack. This cloud is deployed on the standard IT infrastructure of compute, storage, and networking. used hypervisor for telecom and is typically used to run OpenStack. This cloud is deployed on the standard IT infrastructure of compute, storage, and networking. There can be challenges with this setup, especially if it is all or mostly based on VNFs. Management at scale can be difficult with virtual machines. Performance can also be a challenge depending on the hardware used. Similarly, hardware upgrades and migrations can be disruptive; these are all architecture traits unacceptable to the modern network carrier.", "meta": {"ingested_at": 1759756684, "relative_path": "wp-past-present-future-telecom-cloud.pdf"}}
{"chunk_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b-7", "doc_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b", "source": "wp-past-present-future-telecom-cloud.pdf", "file_name": "wp-past-present-future-telecom-cloud.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 7, "text": "challenge depending on the hardware used. Similarly, hardware upgrades and migrations can be disruptive; these are all architecture traits unacceptable to the modern network carrier. Uncomplicate Data Storage, Forever 5 BUSINESS WHITE PAPER Adding the Edge While a great deal of telecom data infrastructure is based in core data centers, most telecoms are beginning to move workloads out to the edge. This is being done to capitalize on new 5G opportunities opening in factories, transportation networks, smart cities, and other locations. Locating and analyzing data at the point of creation reduces latency and increases time to value. One way to do this is by taking advantage of public cloud providers. Carriers may also use their own data centers or co-location facilities to grow their geographic reach. The main change here is the addition of public cloud and edge services. Figure 2. The above diagram is very typical for many network carriers. While core data center assets remain prominent, geographic reach is being expanded via public cloud relationships and the deployment of more edge locations. VNFs remain prominent, though future direction is strongly toward CNFs. This is where most telecom providers are today. Many services and applications are still running in virtual machines, but containers are gaining a greater presence, especially for the edge services. AI services for telecoms will also play a large part in edge deployments. While not yet widely deployed, providers are discovering that smaller AI footprints at the edge may be more useful that massive AI projects in the data center. Challenges here can include overall management, especially while still in a mix of VNFs and CNFs, as well as refactoring applications to work in the cloud. The Present Telecom Cloud Powered by Pure Storage While moving to the future cloud is the goal, realistically many carriers will be deploying some form of the present cloud for several years before they can fully transition. Most of these clouds are built on an OpenStack infrastructure. Traditional storage solutions can limit the benefits of OpenStack due to a lack of integration and a reliance on multiple legacy tools. White-box storage nodes can be costly to maintain, slow, and extremely complex. Pure Storage streamlines OpenStack deployments by simplifying integration, enhancing performance, and increasing storage efficiency. With Pure, no pre-configuration is required. All Pure", "meta": {"ingested_at": 1759756684, "relative_path": "wp-past-present-future-telecom-cloud.pdf"}}
{"chunk_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b-8", "doc_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b", "source": "wp-past-present-future-telecom-cloud.pdf", "file_name": "wp-past-present-future-telecom-cloud.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 8, "text": "and extremely complex. Pure Storage streamlines OpenStack deployments by simplifying integration, enhancing performance, and increasing storage efficiency. With Pure, no pre-configuration is required. All Pure and extremely complex. Pure Storage streamlines OpenStack deployments by simplifying integration, enhancing performance, and increasing storage efficiency. With Pure, no pre-configuration is required. All Pure configuration is controlled by the Pure Storage Cinder driver for OpenStack. This integration with Cinder—the block-storage service for OpenStack—can save deployment and maintenance time; storage administrators aren’t required to learn another tool or waste time setting up multiple back-end arrays. All storage activities can be done through the OpenStack GUI, including creating and deleting volumes, attaching and detaching hosts, creating snapshots, and much more. Pure Storage has collaborated on OpenStack projects for many years, and continues to actively contribute to OpenStack development, providing over 50,000 lines of code to the community. Pure is certified with Red Hat OpenStack and has numerous integrations with Canonical OpenStack.", "meta": {"ingested_at": 1759756684, "relative_path": "wp-past-present-future-telecom-cloud.pdf"}}
{"chunk_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b-9", "doc_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b", "source": "wp-past-present-future-telecom-cloud.pdf", "file_name": "wp-past-present-future-telecom-cloud.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 9, "text": "OpenStack development, providing over 50,000 lines of code to the community. Pure is certified with Red Hat OpenStack and has numerous integrations with Canonical OpenStack. Uncomplicate Data Storage, Forever 6 BUSINESS WHITE PAPER The Future Cloud The telecom future cloud is already with us, at least in part. The true future cloud will be entirely container-based, which will be the only way to efficiently and effectively deliver 5G powered services at scale, especially at the edge. Containers deliver the automation and resiliency required, along with support for DevSecOps, global monitoring, and reporting. Figure 3. The future cloud will consist entirely of containerized services and applications. These will provide the scale, performance, and flexibility required to deliver new 5G services across the edge and public clouds. The infrastructure will be a core-cloud-edge design, comprising both physical hardware resources (data center, co-lo), as well as public cloud services and edge locations. Management needs to be uniform across the entire framework or else it will be too complex to scale. One of the challenges here will be avoiding proprietary solutions that lock-in users and limit flexibility and choice. While the future cloud holds great promise, is there a simpler way to get there today? Yes, with the telecom cloud powered by Pure Storage. The Future Telecom Cloud Powered by Pure Storage The key to the telecom cloud is Portworx® by Pure Storage. Portworx dramatically simplifies the deployment of containerized applications by taking care of many critical storage operations. Essential telecom data operations—such as backup, disaster recovery, cloud migrations, security, and capacity management—are provided by native Kubernetes data services. Perhaps more importantly, Portworx is totally open and provides a layer of operational consistency and uniformity of management across core, cloud, and edge. Portworx operates across multiple public clouds and with any physical storage infrastructure, though Pure Storage users gain unique benefits (see below for details). Multiple Kubernetes platforms are supported, including Amazon EKS and ECS, Azure AKS, Google GKE, Pivotal PKS, and Red Hat OpenShift. Portworx also provides built-in support for popular data services, such as Cassandra, Elastic, Kafka, MongoDB, MySQL, and more.", "meta": {"ingested_at": 1759756684, "relative_path": "wp-past-present-future-telecom-cloud.pdf"}}
{"chunk_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b-10", "doc_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b", "source": "wp-past-present-future-telecom-cloud.pdf", "file_name": "wp-past-present-future-telecom-cloud.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 10, "text": "GKE, Pivotal PKS, and Red Hat OpenShift. Portworx also provides built-in support for popular data services, such as Cassandra, Elastic, Kafka, MongoDB, MySQL, and more. Uncomplicate Data Storage, Forever\n7\nBUSINESS WHITE PAPER\nFigure 4: Key telecom applications and services can be containerized and run on top of the Portworx platform, which delivers numerous telecom-class features and unifies management \nacross varied physical infrastructure components as well as public clouds. \nThis frees operators to work with existing infrastructure and/or cloud partners and allows them to easily change both data center \nassets and partners over time. It offers flexibility when entering new markets for telecom services that will expand as \n5G connectivity is more widely available.\nWith Portworx in place, container-based applications are more easily deployed thanks to numerous features, including:\n• \nContainer-optimized volumes with elastic scaling for no application downtime\n• \nHigh availability across nodes, racks, and/or availability zones, allowing applications to failover in seconds\n• \nStorage-aware class-of-service (COS) and application-aware I/O tuning, helping \nensure your most critical workloads meet their required service levels\n• \nAny-cloud migration to easily move entire applications across clusters, racks, and clouds\n• \nAutomated capacity management to avoid over-provisioning storage capacity\n• \nApplication-aware data protection for complex distributed applications\n• \nZero RPO disaster recovery for data centers in a metropolitan area as well as continuous backups across the WAN\n• \nCluster-wide encryption\n• \nRole-based access control for authorization, authentication, and ownership.", "meta": {"ingested_at": 1759756684, "relative_path": "wp-past-present-future-telecom-cloud.pdf"}}
{"chunk_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b-11", "doc_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b", "source": "wp-past-present-future-telecom-cloud.pdf", "file_name": "wp-past-present-future-telecom-cloud.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 11, "text": "centers in a metropolitan area as well as continuous backups across the WAN • Cluster-wide encryption • Role-based access control for authorization, authentication, and ownership. Uncomplicate Data Storage, Forever 8 BUSINESS WHITE PAPER purestorage.com 800.379.PURE ©2024 Pure Storage, Inc. All rights reserved. Pure Storage, the P logo mark, FlashArray, FlashBlade, Pure1, and Evergreen are trademarks or registered trademarks of Pure Storage, Inc. All other names may be trademarks of their respective owners. PS2339-02-en 05/24 For even further simplification of deployment, Pure also offers Portworx Data Services (PDS) which provides a one-click deployment model for Kubernetes-based data services. Rather than requiring in-house expertise for every needed data service, PDS enables you to deploy new services along with Day 2 operational needs (e.g., backup, capacity management, data migrations, etc.) all handled for you. Supported data services include Cassandra, Kafka, Postgres, Redis, Zookeeper, and RabbitMQ, with more planned. Portworx Integration with Pure Storage Arrays As 100% software, Portworx runs on any infrastructure. But by using Portworx, in conjunction with Pure FlashArray™ and Pure FlashBlade®, you benefit from Kubernetes-native storage and data management, as well as industry-leading performance. Portworx can directly provision FlashArray volumes and mount them to pods. Once mounted, the application writes data directly onto the arrays. Similarly, FlashBlade users can take advantage of direct access file systems. Portworx also integrates with Pure1® cloud management, providing a consolidated view of all Portworx clusters for monitoring essential metrics like cluster health, configuration, and support-case management. High Density, Low-power Storage Telecom providers are increasingly concerned with the power being consumed by their data centers. The telecom industry is responsible for 1.6% of global CO2 emission1, a number that is growing rapidly in the face of data increases. Pure Storage has the most power-efficient storage systems in the industry. Pure Storage provides up to 80% less power consumption than competitive all-flash arrays and uses 96% less space than the hybrid disk storage commonly used by carriers. Conclusion As the global 5G rollout opens new revenue streams for telecom providers, organizations will require flexibility and responsiveness to capitalize on the opportunities. The only", "meta": {"ingested_at": 1759756684, "relative_path": "wp-past-present-future-telecom-cloud.pdf"}}
{"chunk_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b-12", "doc_id": "13f83b96-0faf-44a7-8613-d0c9792d8c8b", "source": "wp-past-present-future-telecom-cloud.pdf", "file_name": "wp-past-present-future-telecom-cloud.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 12, "text": "As the global 5G rollout opens new revenue streams for telecom providers, organizations will require flexibility and responsiveness to capitalize on the opportunities. The only As the global 5G rollout opens new revenue streams for telecom providers, organizations will require flexibility and responsiveness to capitalize on the opportunities. The only methodology that has the proven speed and resiliency needed is what we have called the telecom future cloud, based on Kubernetes and containers. Pure Storage is well positioned with the technologies needed to help telecom providers deliver on the promises of 5G. Additional Resources • Visit Pure’s telecom industry page. • Catch up on Pure’s telecom blogs. • FlashArray integration with OpenStack. • Learn about Pure Storage solutions for Artificial Intelligence. 1 Source: https://www.bcg.com/press/24june2021-telco-sector-game-changer-sustainability-shrinking-carbon-footprints", "meta": {"ingested_at": 1759756684, "relative_path": "wp-past-present-future-telecom-cloud.pdf"}}
