{"chunk_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5-0", "doc_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5", "source": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_name": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 0, "text": "White Paper: \nThe Future of \nTelecom Engineering\nDeveloped by Engineering.com and IEEE.\n\nWHITE PAPER: THE FUTURE OF TELECOM ENGINEERING\n2\nTHE FUTURE OF TELECOM \nENGINEERING\nThe telecommunication industry abounds with new technologies, new \nopportunities and new risks. To keep pace with this accelerating ﬁeld, the \nmodern telecommunications engineer needs a ﬁrm understanding of \nwhere human communication is headed. The topics we talk about in the \nfuture may be unpredictable, but we can at least anticipate how we’ll talk \nabout them. \nIn this engineering.com white paper, we’ll explore the future of \ntelecommunications and what engineers can do to prepare for it. From \n6G to Wi-Fi 7, from AI to the IoT, we’ll take a tour of the telecom tech of \ntomorrow.\n\n3\nWHITE PAPER: THE FUTURE OF TELECOM ENGINEERING\nFROM 5G TO 6G AND BEYOND\n4\nTALKING WITH ARTIFICIAL INTELLIGENCE\n5\n6\nGETTING SMARTER WITH THE INTERNET OF THINGS\n7\nCYBERSECURITY IN A CONNECTED WORLD\n9\nCONCLUSION\n10\nTABLE OF CONTENTS", "meta": {"ingested_at": 1759756682, "relative_path": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf"}}
{"chunk_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5-1", "doc_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5", "source": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_name": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 1, "text": "TALKING WITH ARTIFICIAL INTELLIGENCE 5 6 GETTING SMARTER WITH THE INTERNET OF THINGS 7 CYBERSECURITY IN A CONNECTED WORLD 9 CONCLUSION 10 TABLE OF CONTENTS 4 WHITE PAPER: THE FUTURE OF TELECOM ENGINEERING Roughly every decade, there’s a new generation—G—of cellular communication. With each new generation comes performance, speed and bandwidth improvements that enable us to talk to one another more reliably, browse the internet more easily and download data more quickly. The world is currently shifting from 4G to 5G. But even as this transition is underway, the next generation is already in the works. 6G is coming. Deﬁning the next generation of cellular standards is a massive collaborative effort, with industry, academia and government working together to shape the regulations and technologies needed to take the next step. It is a process that takes careful planning over many years. The earliest research into 6G began in 2019, even before the ﬁrst commercial deployments of 5G networks. Moving from 4G to 5G involved a big change in the wireless spectrum, introducing millimeter wave (mmWave) frequency bands as part of the standard. This was a dramatic increase in frequency, a jump from less than 6 GHz for 4G to 28 GHz and higher for 5G (though 5G can and does make use of lower frequency bands). The shift to 6G may prove even more dramatic, with early research hinting at possible terahertz frequency bands (typically deﬁned as greater than 300 GHz). The choice of spectrum has implications for every aspect of 6G design, with higher frequencies offering greater speeds but reduced range. And the speeds could be blistering. 6G may prove more than a thousand times faster than 5G, with a peak data rate of 1 Tbps. But the corresponding reduction in range will require a different type of cell architecture, with some suggesting that a type of cell called a femtocell may be warranted. Femtocells are small, low power access nodes that cover a much smaller cell size and frequency range than the more conventional cellular towers used in prior generations. 6G may also require the use of distributed antenna systems (DASs) which help ensure wireless coverage throughout certain indoor or outdoor environments. Though research into 6G is still in its early stages, the technology is expected to be ready for deployment by 2030—a scant eight years away. In today’s fast- changing technological", "meta": {"ingested_at": 1759756682, "relative_path": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf"}}
{"chunk_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5-2", "doc_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5", "source": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_name": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 2, "text": "still in its early stages, the technology is expected to be ready for deployment by 2030—a scant eight years away. In today’s fast- changing technological still in its early stages, the technology is expected to be ready for deployment by 2030—a scant eight years away. In today’s fast- changing technological landscape, that seems both a blink and an eternity. Whatever the next eight years bring, it’s important for telecommunications engineers to be aware of the progress in 6G and plan accordingly. One of the most effective ways to do so is by staying up to date with the latest research into 6G, through journal articles, draft standards, or even online courses. The changes 6G brings will have an effect on almost every other area of telecommunications, including what may prove to be the most signiﬁcant: artiﬁcial intelligence. FROM 5G TO 6G AND BEYOND (Image source: Vyacheslav Shatskiy via Unsplash.)", "meta": {"ingested_at": 1759756682, "relative_path": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf"}}
{"chunk_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5-3", "doc_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5", "source": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_name": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 3, "text": "of telecommunications, including what may prove to be the most signiﬁcant: artiﬁcial intelligence. FROM 5G TO 6G AND BEYOND (Image source: Vyacheslav Shatskiy via Unsplash.) 5 WHITE PAPER: THE FUTURE OF TELECOM ENGINEERING Artiﬁcial intelligence (AI) is perhaps the most important technology of our time. It has the potential to upend almost every domain of human endeavour, and of course, telecommunications is not immune. Wireless networks—particularly 6G networks—will both support future AI applications as well as beneﬁt from them. As a support for AI, 6G networks will build upon the advances of 5G to enable real-time AI applications and networks. One of the most promising examples is autonomous vehicles, which are expected to combine both local processing with edge and cloud computing. Self-driving cars will likely also send and receive sensor data from other autonomous vehicles, or from trafﬁc sensors that make up part of a connected smart city. The sheer volume of data combined with an explosion in the number of endpoints demands an evolution of wireless networking, one which both 5G and subsequently 6G are attempting to meet. We’ll have more to say on this topic in the section on the Internet of Things (IoT). As a beneﬁciary of AI, 6G and other telecommunications standards will be able to improve in untold ways. There are many networking functions that could potentially be optimized by machine learning (ML) or other AI algorithms, such as beamforming, envelope tracking, mobility management, localization and interference management, to name a few. There is almost no limit to the ways in which AI could potentially impact radio networks. The beneﬁts of this approach would be enormous: improving spectral efﬁciency, saving power, increasing network throughput, reducing network loading, improving reliability and ultimately delivering a higher quality experience for end users. The process of incorporating AI into radio networks is just beginning, but with the potential beneﬁts of the technology, it will soon be common practice. Wireless chipmakers including Qualcomm and MediaTek have begun incorporating dedicated AI processors into certain products, such as Qualcomm’s Snapdragon X70, which the company touts as the world’s ﬁrst 5G AI processor in a 5G modem-RF system. Network operators such as Verizon have also begun experimenting with AI, with the American telecom recently rolling out its", "meta": {"ingested_at": 1759756682, "relative_path": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf"}}
{"chunk_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5-4", "doc_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5", "source": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_name": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 4, "text": "processor in a 5G modem-RF system. Network operators such as Verizon have also begun experimenting with AI, with the American telecom recently rolling out its processor in a 5G modem-RF system. Network operators such as Verizon have also begun experimenting with AI, with the American telecom recently rolling out its so-called 5G Network Planning Platform, which uses machine learning to optimize the density and positioning of its transmitters. AI is a broad and ever-expanding topic. To keep pace, telecommunications engineers should seek to stay up to date with how the technology is shaping their ﬁeld—as well as how their ﬁeld is helping enable the technology. News articles, white papers, and research reports from trusted sources are a good way to keep abreast of the latest AI developments. TALKING WITH ARTIFICIAL INTELLIGENCE", "meta": {"ingested_at": 1759756682, "relative_path": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf"}}
{"chunk_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5-5", "doc_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5", "source": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_name": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 5, "text": "articles, white papers, and research reports from trusted sources are a good way to keep abreast of the latest AI developments. TALKING WITH ARTIFICIAL INTELLIGENCE 6 WHITE PAPER: THE FUTURE OF TELECOM ENGINEERING Just as 5G will make way for 6G in the cellular world, in the wireless local area network (WLAN) world, Wi-Fi is preparing for its next major iteration: from Wi-Fi 6 to Wi-Fi 7. The shift is being driven by many of the same factors motivating the cellular transition, including the growing popularity of data- intensive and latency-sensitive applications such as high-resolution video streaming, augmented and virtual reality and the Internet of Things (IoT). Wi-Fi is and will continue to be a crucial enabler of these emerging applications. It is an incredibly popular wireless standard, and it will only grow more so in the era of 5G and 6G as a complement to those technologies. According to the Cisco Annual Internet Report from 2020, by 2023 there will be a total of 628 million global public Wi-Fi hotspots, quadruple the number from 2018. That incredible growth in a span of just ﬁve years is a result of what the report describes as “our insatiable demand for wireless connectivity”—a demand that shows no signs of slowing down. In that case, Wi-Fi will just have to speed up. Throughput is one of the primary goals of the Wi-Fi 7 standard, which is expected to reach data rates up to 40 Gbps. In fact, the technical standard that will form the basis of Wi- Fi 7 is called IEEE 802.11be EHT, for Extremely High Throughput. The IEEE 802 collection of standards is available through IEEE, and engineers should examine it and other telecommunications standards regularly, as these are fantastic roadmaps for the future of the industry. Another big change for Wi- Fi is the opening of a brand-new band, 6 GHz, in addition to the existing 2.4 GHz and 5 GHz bands. The addition of the 6 GHz band began with the Wi- Fi 6E standard (the E denotes the extension into higher spectrum) and will continue into Wi-Fi 7, presenting both new design challenges as well as new opportunities for enhancing WLAN networks. The Wi-Fi 7 standard has been in development since 2019, and the ﬁnal version is expected to be released by 2024. By staying up to date on the standard and its associated technologies, telecommunication engineers will be equipped to design and deploy solutions at the cutting", "meta": {"ingested_at": 1759756682, "relative_path": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf"}}
{"chunk_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5-6", "doc_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5", "source": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_name": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 6, "text": "By staying up to date on the standard and its associated technologies, telecommunication engineers will be equipped to design and deploy solutions at the cutting By staying up to date on the standard and its associated technologies, telecommunication engineers will be equipped to design and deploy solutions at the cutting edge of wireless local area networking. (Image source: Stephen Phillips via Unsplash.)", "meta": {"ingested_at": 1759756682, "relative_path": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf"}}
{"chunk_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5-7", "doc_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5", "source": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_name": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 7, "text": "telecommunication engineers will be equipped to design and deploy solutions at the cutting edge of wireless local area networking. (Image source: Stephen Phillips via Unsplash.) 7 WHITE PAPER: THE FUTURE OF TELECOM ENGINEERING The internet has brought people from all over the world together in a form and scale without precedence in human civilization. The overall impact is still being felt, not to mention debated, but its magnitude is without question. For several years, engineers have been working to expand the internet, and its enormous potential, beyond connecting people and into the realm of everything else: the Internet of Things (IoT). The premise of the IoT is to network everything and anything that might beneﬁt from being online. These things range from what some may consider fatuous, like a water bottle that connects to a smartphone app, to things that are undoubtedly valuable, like a bridge outﬁtted with strain sensors that can send warnings before a failure. For consumers, there has been an explosion of IoT devices in the past few years—especially those geared for the home, such as color-changing lights controlled with a smartphone, internet-connected speakers with voice assistants, security cameras that stream live footage, app-driven keyless entry systems and more. The proliferation of these connected devices has popularized the term “smart” home, and indeed, many IoT devices bear that label themselves. Smart doesn’t end at the home. Smart factories have proven just as popular in industry, where connecting machinery, robots, vehicles and stock through the IoT can provide unprecedented levels of insight into an operation. In this context, the IoT becomes the IIoT, or Industrial Internet of Things. The technological trend has also been called Industry 4.0 as well as the Fourth Industrial Revolution. And smart doesn’t end at the factory, either. The vision of smart cities describes an IoT-connected metropolis with sensors to measure trafﬁc, weather, noise, pollution or any other data that can be shared with denizens, their smart homes or their smart cars. Research ﬁrm IoT Analytics predicts that by 2025, there will be about 27 billion IoT devices online. To cope with that staggering ﬁgure, telecommunications engineers have devised new networking approaches and protocols. Low power wide area networks (LPWANs) are an emerging class of protocols made to connect the many IoT sensors that are hard to access and must account for a", "meta": {"ingested_at": 1759756682, "relative_path": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf"}}
{"chunk_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5-8", "doc_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5", "source": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_name": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 8, "text": "networks (LPWANs) are an emerging class of protocols made to connect the many IoT sensors that are hard to access and must account for a networks (LPWANs) are an emerging class of protocols made to connect the many IoT sensors that are hard to access and must account for a limited battery life. There is a plethora of LPWAN protocols, some that use cellular spectrum, and others that employ unlicensed bands. As the IoT and IIoT continue to grow in popularity, progress into these and other networking protocols must keep pace. GETTING SMARTER WITH THE INTERNET OF THINGS", "meta": {"ingested_at": 1759756682, "relative_path": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf"}}
{"chunk_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5-9", "doc_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5", "source": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_name": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 9, "text": "IoT and IIoT continue to grow in popularity, progress into these and other networking protocols must keep pace. GETTING SMARTER WITH THE INTERNET OF THINGS 8\nWHITE PAPER: THE FUTURE OF TELECOM ENGINEERING\nTo understand the needs of future networks, and be able to design and \nbuild them, today’s telecom engineers must understand the Internet of \nThings. Fortunately, there are many resources for learning about the IoT: \nnews articles covering software, hardware, and networking developments; \nstandards describing new communications protocols for IoT devices; and \nwhite papers outlining newfound security threats and vulnerabilities, to \nname a few, available through trusted resources such as IEEE DiscoveryPoint \nfor Communications.", "meta": {"ingested_at": 1759756682, "relative_path": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf"}}
{"chunk_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5-10", "doc_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5", "source": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_name": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 10, "text": "IoT devices; and white papers outlining newfound security threats and vulnerabilities, to name a few, available through trusted resources such as IEEE DiscoveryPoint for Communications. 9 WHITE PAPER: THE FUTURE OF TELECOM ENGINEERING Cybersecurity has always been a critical topic for telecommunications engineers, who build the platforms that transmit and receive the most sensitive information on the planet. Ensuring secure communication is a difﬁcult, multilayered task that must be shared by everyone involved in sending a message, from the sender on down to an RF circuit designer. As telecommunications systems evolve to keep up with new technologies and changing user expectations, it’s inevitable that new cybersecurity threats arise. In the case of the transition to 5G, telecom operators are facing what may possibly be the biggest security threat they’ve yet seen. That’s because a number of 5G networks are being built with the principles of virtualization, which replaces speciﬁc networking hardware with software hosted in a cloud environment. Virtualized networks are quicker and easier to deploy, upgrade and reconﬁgure, but they are much more vulnerable to hackers—especially if operators don’t implement, let alone understand, the security requirements of the cloud. Another looming cybersecurity threat is that posed by the introduction of quantum computers. Many major companies are working to develop and commercialize quantum technology, but for the moment, it remains extremely limited. Before that changes, it’s imperative for telecommunication engineers to understand the implications of the technology, which has the potential to shatter the standard methods of encryption that are widely used today. Only by anticipating this and other cybersecurity risks engendered by quantum computers can engineers work to mitigate them, and this requires actively seeking the latest news and research into the ﬁeld. Cybersecurity concerns can’t be taken lightly, and in some instances, regulators are getting heavily involved. In 2021, for instance, the U.K. government passed the Telecommunications Security Act to enforce U.K. telecoms to adhere to strict security practices, with heavy ﬁnes as a punishment for those who fail to comply. In 2022, the EU released a draft of its planned Cyber Resilience Act, which aims to enforce cybersecurity mandates for a wide variety of connected devices and software. Not all", "meta": {"ingested_at": 1759756682, "relative_path": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf"}}
{"chunk_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5-11", "doc_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5", "source": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_name": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 11, "text": "a draft of its planned Cyber Resilience Act, which aims to enforce cybersecurity mandates for a wide variety of connected devices and software. Not all a draft of its planned Cyber Resilience Act, which aims to enforce cybersecurity mandates for a wide variety of connected devices and software. Not all jurisdictions have taken these measures, but in a world where cyberattacks are becoming increasingly common—and costly— it’s only a matter of time. Cybersecurity is often considered an arms race, with bad actors working to ﬁnd cracks just as diligently as good actors are seeking to prevent them. In such a race, it is absolutely imperative to maintain situational awareness of the latest ﬂaws, breaches and best practices—and that’s especially true for telecommunications engineers, who play an outsized role in defending security. CYBERSECURITY IN A CONNECTED WORLD", "meta": {"ingested_at": 1759756682, "relative_path": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf"}}
{"chunk_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5-12", "doc_id": "14df2db9-53f7-4ebe-b413-3cb814d616e5", "source": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_name": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 12, "text": "latest ﬂaws, breaches and best practices—and that’s especially true for telecommunications engineers, who play an outsized role in defending security. CYBERSECURITY IN A CONNECTED WORLD 10 WHITE PAPER: THE FUTURE OF TELECOM ENGINEERING This white paper is sponsored by IEEE. To learn more, visit IEEE DiscoveryPoint for Communications . In this broad tour of the technological trends shaping telecommunications engineering today, we’ve examined how 6G, Wi-Fi 7, AI, the IoT and cybersecurity concerns are shaping the networks of the future. And while each of these topics is important in its own right (not to mention much bigger than we’ve had time to explore), what’s really worth paying attention to are the connections between them. AI and machine learning will have a role to play in the design and eventual operation of 6G networks and in the evolving cybersecurity arms race. Wi-Fi 7 and 6G will enable smart devices on the Internet of Things, which will itself support ever-expanding AI applications. Security measures will be a top consideration in the development of smart devices and the networks that support them. In telecommunications engineering, no topic exists in a vacuum. To help engineers stay abreast of this rapidly expanding technology, IEEE recently launched IEEE DiscoveryPoint for Communications, a new online platform that selects and consolidates information sources around the most important trends in telecommunication. Made for telecommunication engineers looking to keep pace with their rapidly-changing industry, IEEE DiscoveryPoint for Communications provides a hand-curated set of dashboards organized by topic—including the ones discussed in this white paper as well as many more. Containing news, articles, reports, technical standards, and other valuable resources from trusted sources, IEEE DiscoveryPoint for Communications is designed to be a one-stop shop for all things telecommunications. To prepare for the future—and to ensure a solid grasp of the present—it is imperative for telecommunications engineers to reinforce their knowledge, seek new solutions, and evaluate emerging technologies. Thankfully, with the help of the global communications networks they themselves have built and the right tools and resources, it’s never been easier to stay informed. CONCLUSION", "meta": {"ingested_at": 1759756682, "relative_path": "IEEE-DP-White-Paper-The-Future-of-Telecom-Engineering-R1-B.pdf"}}
