{"chunk_id": "86387c09-18c6-41a2-9475-572b7988ee5c-0", "doc_id": "86387c09-18c6-41a2-9475-572b7988ee5c", "source": "Appledore-TIP-Whitepaper.pdf", "file_name": "Appledore-TIP-Whitepaper.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 0, "text": "Whitepaper \nSeptember 2022 \nInnovation Unleashed \nOpen RAN Orchestration & Management Automation \nAuthor: Francis Haysom and Robert Curran \n \nIn collaboration with\n\nInnovation Unleashed - Open RAN Orchestration & Management Automation \nPage 2 \nwww.appledoreresearch.com \n© Telecom Infra Project 2022 \n \nCopyright © 2022 Telecom Infra Project, Inc. and its Contributors. All rights reserved. \nThe Telecom Infra Project logo is a trademark of Telecom Infra Project, Inc. (the “Project”) in the \nUnited States or other countries and is registered in one or more countries. Removal of any of the \nnotices or disclaimers contained in this document is strictly prohibited. The publication of this \ndocument is for informational purposes only. \nTHIS DOCUMENT IS PROVIDED “AS IS,” AND WITHOUT ANY WARRANTY OF ANY KIND, INCLUDING \nWITHOUT LIMITATION, ANY EXPRESS OR IMPLIED WARRANTY OF NONINFRINGEMENT, \nMERCHANTABILITY, OR FITNESS FOR A PARTICULAR PURPOSE. UNDER NO CIRCUMSTANCES WILL THE \nPROJECT BE LIABLE TO ANY PARTY UNDER ANY CONTRACT, STRICT LIABILITY, NEGLIGENCE OR OTHER \nLEGAL OR EQUITABLE THEORY, FOR ANY INCIDENTAL INDIRECT, SPECIAL, EXEMPLARY, PUNITIVE, OR \nCONSEQUENTIAL DAMAGES OR FOR ANY COMMERCIAL OR ECONOMIC LOSSES, WITHOUT LIMITATION, \nINCLUDING AS A RESULT OF PRODUCT LIABILITY CLAIMS, LOST PROFITS, SAVINGS OR REVENUES OF ANY \nKIND IN CONNECTION WITH THE SUBJECT MATTER OR USE OF THIS DOCUMENT. \nPublication date: 15 September 2022 \nPhoto by Skye Studios on Unsplash", "meta": {"ingested_at": 1759756682, "relative_path": "Appledore-TIP-Whitepaper.pdf"}}
{"chunk_id": "86387c09-18c6-41a2-9475-572b7988ee5c-1", "doc_id": "86387c09-18c6-41a2-9475-572b7988ee5c", "source": "Appledore-TIP-Whitepaper.pdf", "file_name": "Appledore-TIP-Whitepaper.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 1, "text": "OF ANY KIND IN CONNECTION WITH THE SUBJECT MATTER OR USE OF THIS DOCUMENT. Publication date: 15 September 2022 Photo by Skye Studios on Unsplash Innovation Unleashed - Open RAN Orchestration & Management Automation \n© Telecom Infra Project 2022 \nwww.appledoreresearch.com \nPage 3 \n \nContents \nINTRODUCTION ................................................................................................................................... 4 \nTHE RECIPE FOR GROWTH ................................................................................................................. 5 \nTHE ROLE OF ORCHESTRATION ........................................................................................................ 6 \nOPEN RAN SERVICE MANAGEMENT AND ORCHESTRATION (SMO) ............................................. 7 \nAUTOMATION ....................................................................................................................................... 9 \nENABLING THIRD-PARTY INNOVATION ........................................................................................ 10 \nPEOPLE, PROCESS AND ORGANIZATIONAL CHALLENGES ........................................................ 10 \nTELECOM INFRA PROJECT (TIP) ....................................................................................................... 11 \nCONCLUSION ...................................................................................................................................... 14", "meta": {"ingested_at": 1759756682, "relative_path": "Appledore-TIP-Whitepaper.pdf"}}
{"chunk_id": "86387c09-18c6-41a2-9475-572b7988ee5c-2", "doc_id": "86387c09-18c6-41a2-9475-572b7988ee5c", "source": "Appledore-TIP-Whitepaper.pdf", "file_name": "Appledore-TIP-Whitepaper.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 2, "text": "7 AUTOMATION ....................................................................................................................................... 9 ENABLING THIRD-PARTY INNOVATION ........................................................................................ 10 PEOPLE, PROCESS AND ORGANIZATIONAL CHALLENGES ........................................................ 10 TELECOM INFRA PROJECT (TIP) ....................................................................................................... 11 CONCLUSION ...................................................................................................................................... 14 Innovation Unleashed - Open RAN Orchestration & Management Automation Page 4 www.appledoreresearch.com © Telecom Infra Project 2022 INTRODUCTION Interest in Open RAN continues to grow, especially now that industry pioneers are reporting positive progress from their initiatives and moving ahead with wider rollout plans. Confidence has also been boosted by independent industry studies which prove that the performance of large scale, commercial open RAN networks can rank among the best networks in the world. More operators who are not already committed to rolling out Open RAN have announced plans to at least explore its potential, and to share knowledge and experiences with other operators. Open RAN, while not yet the mainstream approach, has nonetheless become a mainstream influence on the strategies of operators and vendors, large and small. That influence can be seen in how the focus of industry discussion about Open RAN has shifted. Operators have moved on from concerns about whether Open RAN was technically feasible to considering how to operationalize this new kind of radio access network. Several years into the Open RAN project, operators now place less emphasis on seeing a 30-40% reduction in RAN capex than on the benefits of greater operational agility, faster speed in turning up new services, and opportunities to experiment. Operators taking their first steps in open RAN should take note, on two counts. First, to ensure that their Open RAN efforts are not positioned only as a new technical strategy, but also as a new operational and business strategy; one focused on enabling growth through innovation. Second, that although each operator’s open RAN journey may be unique, there is a significant and growing body of industry experience now available to ease and speed the journey. The new frontier in Open RAN sees an equal emphasis being placed both on network equipment interoperability and wider business and network operations. While the buildout of an open RAN has much in common with a traditional RAN (sites to plan, backhaul to size and procure, …) there are also new or radically changed operating principles that telcos must incorporate into their plans. Three key aspects stand out. First, orchestration – the ability to", "meta": {"ingested_at": 1759756682, "relative_path": "Appledore-TIP-Whitepaper.pdf"}}
{"chunk_id": "86387c09-18c6-41a2-9475-572b7988ee5c-3", "doc_id": "86387c09-18c6-41a2-9475-572b7988ee5c", "source": "Appledore-TIP-Whitepaper.pdf", "file_name": "Appledore-TIP-Whitepaper.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 3, "text": "also new or radically changed operating principles that telcos must incorporate into their plans. Three key aspects stand out. First, orchestration – the ability to also new or radically changed operating principles that telcos must incorporate into their plans. Three key aspects stand out. First, orchestration – the ability to coordinate the various resources required from across a distributed cloud to provide a reliable service to customers. Second, automation. Not only to ensure scalable operations but also as an integral part of the third key aspect: innovation. Consistent, rapid introduction of new network capabilities on a continuous basis. If Open RAN is ultimately only seen as a set of nominally open interfaces between components of a traditional RAN it will have failed. Open RAN must foster greater innovation and variety, and so operators also need to be prepared with operations able to process updates on a continuous basis – rather than one designed for a twice-yearly upgrade of core software from a vendor. In this paper, we explain how orchestration and automation are key to the real success of open RAN, and how operators must act to avoid a narrow implementation which undermines their wider Open RAN ambitions beyond simply replicating existing one-size-fits-all mobile broadband RAN. We also reference the work being done by the Telecom Infra Project to accelerate the availability and deployment of orchestration and automation products and solutions, helping the industry achieve the true potential of Open RAN.", "meta": {"ingested_at": 1759756682, "relative_path": "Appledore-TIP-Whitepaper.pdf"}}
{"chunk_id": "86387c09-18c6-41a2-9475-572b7988ee5c-4", "doc_id": "86387c09-18c6-41a2-9475-572b7988ee5c", "source": "Appledore-TIP-Whitepaper.pdf", "file_name": "Appledore-TIP-Whitepaper.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 4, "text": "Infra Project to accelerate the availability and deployment of orchestration and automation products and solutions, helping the industry achieve the true potential of Open RAN. Innovation Unleashed - Open RAN Orchestration & Management Automation © Telecom Infra Project 2022 www.appledoreresearch.com Page 5 THE RECIPE FOR GROWTH Mobile operators are having to rethink conventional strategies for growth. In mature markets, coverage does not provide the differentiator that it once did. New consumers in less well covered locations are more costly to extend coverage to. Further expansion within the enterprise will mean learning about new, unfamiliar problems, and coming up with ways to solve them using new combinations of mobile, edge, AI and cloud. Part of the case for open RAN is that niche applications can be served economically by using disaggregated components that can be deployed in a greater variety of combinations and using a wider range of form factors. For example, macro, urban, rural, indoor, campus networks or simply serving specialized industrial contexts (hot/cold/humid, dangerous or remote). Such growth opportunities require operators to come up with compelling new services for consumers and business customers – that is, they must innovate. They must also be able to deliver these at scale, through automation of their business processes and of the network lifecycle. Innovation and automation are tightly interwoven, and fortunately have common enablers. Automation makes innovation practicable financially. Innovation without automation simply drives up complexity and cost. Automation without innovation similarly means entrenching existing operational and service status quo, as can be already seen, in the early deployments of advanced technologies such as 5G and SDN. Traditional “trade-off” thinking (keeping costs down vs innovating) is, we believe, a false dilemma. The industry must pursue both. Compared to earlier generations of telecom operators, a modern operator requires new and different capabilities: • Ability to innovate cost-effectively at scale. This implies low cost, rapid innovation that is both practical and economically viable at low service volumes, resulting in “mass customization” – the ability for 100s or 1000s of semi-unique services to collectively create a huge and profitable market. • Ability to create services that span technologies, layers, and ownership domains. These", "meta": {"ingested_at": 1759756682, "relative_path": "Appledore-TIP-Whitepaper.pdf"}}
{"chunk_id": "86387c09-18c6-41a2-9475-572b7988ee5c-5", "doc_id": "86387c09-18c6-41a2-9475-572b7988ee5c", "source": "Appledore-TIP-Whitepaper.pdf", "file_name": "Appledore-TIP-Whitepaper.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 5, "text": "1000s of semi-unique services to collectively create a huge and profitable market. • Ability to create services that span technologies, layers, and ownership domains. These 1000s of semi-unique services to collectively create a huge and profitable market. • Ability to create services that span technologies, layers, and ownership domains. These domains may include public cloud providers, shared data centers, other CSPs, and assets (such as LANs) of the enterprise customer itself. This is the basis for many IoT and “digital services'' ecosystems. • Ability to introduce new features and functionality quickly, and with low effort. A “forklift” upgrade process is out of alignment with customer expectations, especially given the continuous adjustments of hyperscale digital service providers. • Reduce the “Integration tax” – between maintenance and integration/re-integration, simply maintaining the software already in place consumes a major proportion of a CSP’s IT budget, and correspondingly squeezes out modernization, new features, and innovation itself. It is within this context that orchestration really sits: addressing the question of how telecom operators can enable operational improvements, innovation and on-demand services.", "meta": {"ingested_at": 1759756682, "relative_path": "Appledore-TIP-Whitepaper.pdf"}}
{"chunk_id": "86387c09-18c6-41a2-9475-572b7988ee5c-6", "doc_id": "86387c09-18c6-41a2-9475-572b7988ee5c", "source": "Appledore-TIP-Whitepaper.pdf", "file_name": "Appledore-TIP-Whitepaper.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 6, "text": "itself. It is within this context that orchestration really sits: addressing the question of how telecom operators can enable operational improvements, innovation and on-demand services. Innovation Unleashed - Open RAN Orchestration & Management Automation Page 6 www.appledoreresearch.com © Telecom Infra Project 2022 THE ROLE OF ORCHESTRATION In a conventional RAN, key functions are provided within a pre-integrated set of software and hardware provided by a RAN vendor, in a Baseband Unit (BBU). The BBU is typically deployed at each cell site. Configuration and management of the RAN is through a centralized network management system. Open RAN builds on an O-RAN Alliance Specification that separates (“disaggregates”) the BBU into logical components of Radio Unit (RU), Distributed Unit (DU) and Centralized Unit (CU). This allows for greater flexibility in deployment models, and the possibility of using different specialist providers of RU, DU, and CU. This introduces new interfaces through which the individual RAN components are monitored and managed. Open RAN also enables the separation (vertical disaggregation) of the BBU control plane with the introduction of RAN intelligent controllers (both near-real-time and non-real-time). This introduces the possibility of using new specialist providers to innovate control algorithms tailored for particular use cases, or even to innovate RAN standards in software ahead of standards processes. Disaggregation means that individual component capabilities of the RAN must now be coordinated across cell site, edge and data center locations. Previously internal interactions (such as between the radio LOW-PHY and RF functions, and HIGH-PHY MAC and RLC layer) now take place over a published open RAN interface. For example, Radio Resource Control Protocol (RRC), Packet Data Convergence Protocol (PDCP) can now be run (and scaled/healed) as disaggregated applications on the Centralized Unit, within a data center. All of this requires an overarching orchestration function to determine the health and performance of such functions, apply appropriate policies to how they are managed (as well as secured, updated…), and manage their lifecycle. This is the job of Orchestration. Orchestration is the ability to automate the complete lifecycle of a service, at scale and with agility to change and adapt. In the cloud and hyperscale cloud era, service, as experienced by", "meta": {"ingested_at": 1759756682, "relative_path": "Appledore-TIP-Whitepaper.pdf"}}
{"chunk_id": "86387c09-18c6-41a2-9475-572b7988ee5c-7", "doc_id": "86387c09-18c6-41a2-9475-572b7988ee5c", "source": "Appledore-TIP-Whitepaper.pdf", "file_name": "Appledore-TIP-Whitepaper.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 7, "text": "complete lifecycle of a service, at scale and with agility to change and adapt. In the cloud and hyperscale cloud era, service, as experienced by complete lifecycle of a service, at scale and with agility to change and adapt. In the cloud and hyperscale cloud era, service, as experienced by a customer, may consist of several underlying services, including third-party components, chained together, all elements of which need to be provisioned coherently. The role of orchestration should not be limited only to fulfilment. Instead, it must be seen as a capability spanning fulfilment and assurance, since this is the way to the level of automation (in response to both internal network and service conditions, as well as external requests) that make software-defined networks more flexible and cheaper to run. Fortunately, the Open RAN community has already defined how orchestration should work under this new architectural paradigm.", "meta": {"ingested_at": 1759756682, "relative_path": "Appledore-TIP-Whitepaper.pdf"}}
{"chunk_id": "86387c09-18c6-41a2-9475-572b7988ee5c-8", "doc_id": "86387c09-18c6-41a2-9475-572b7988ee5c", "source": "Appledore-TIP-Whitepaper.pdf", "file_name": "Appledore-TIP-Whitepaper.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 8, "text": "software-defined networks more flexible and cheaper to run. Fortunately, the Open RAN community has already defined how orchestration should work under this new architectural paradigm. Innovation Unleashed - Open RAN Orchestration & Management Automation \n© Telecom Infra Project 2022 \nwww.appledoreresearch.com \nPage 7 \n \nOPEN RAN SERVICE MANAGEMENT AND ORCHESTRATION (SMO) \nWhile the early focus of Open RAN effort has been on ensuring basic interoperability of \ndisaggregated RAN components, Open RAN’s real benefits (including lower operational costs and \nfaster time to market with new features) depend on implementing Service Management and \nOrchestration. \nService Management and Orchestration (SMO) is one of the components of an open RAN \narchitecture, as defined by the O-RAN Alliance. SMO effectively provides Domain Management for an \nopen RAN. \nThe specification defines the SMO as being responsible for RAN domain management (distinct from \ncore, transport management). As such, SMO provides: \n• \nFCAPS functionality across the disaggregated ORAN Network Functions (RU, CU, DU). \n• \nRAN domain optimization (via the non-Real Time RIC). \n• \nRAN Slice Management function. \n• \nManagement, Orchestration and Workflow Management of the O-Cloud infrastructure that \nhosts virtualized network functions. \nThe SMO is home to the non-real-time RIC (RAN Intelligent Controller) for longer duration control \nloops such as network optimization, and the near-real time RIC (fast, greater than or equal to 10ms \nand less than 1 second control loops of RAN management). \nIn an open RAN, four interfaces are identified between the SMO and other components: \n• \nA1, between the non-real-Time RIC and the near-Real-Time RIC. \n• \nO1, for FCAPS support of disaggregated network functions. \nFigure 1: O-RAN high level architecture (Source: ORAN Alliance)", "meta": {"ingested_at": 1759756682, "relative_path": "Appledore-TIP-Whitepaper.pdf"}}
{"chunk_id": "86387c09-18c6-41a2-9475-572b7988ee5c-9", "doc_id": "86387c09-18c6-41a2-9475-572b7988ee5c", "source": "Appledore-TIP-Whitepaper.pdf", "file_name": "Appledore-TIP-Whitepaper.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 9, "text": "the non-real-Time RIC and the near-Real-Time RIC. • O1, for FCAPS support of disaggregated network functions. Figure 1: O-RAN high level architecture (Source: ORAN Alliance) Innovation Unleashed - Open RAN Orchestration & Management Automation \nPage 8 \nwww.appledoreresearch.com \n© Telecom Infra Project 2022 \n \n• \nO2, to the O-Cloud for platform resources and workload management. (The O2 interface \nbetween SMO and the O-Cloud is identified, but not yet fully specified. This is the ongoing job \nof ORAN Alliance Working Group 6). \n• \nM-plane interface for FCAPS support of open Radio Units in case of hybrid mode. \n \nFigure 2: Exposure of SMO and non-Real-Time RIC Framework Services \nIn common with service orchestration more generally, the Open RAN SMO includes: \n• \nA service design capability. \n• \nA common mechanism for the collection of data, both from the RAN as well as from other \nnon-network sources. \n• \nInventory, topology and policy control. \n• \nAn internal interface (“R1”) that allows for additional (non-real-time) RAN management and \noptimization applications – rApps. \nThe establishment of the rApps concept introduces the possibility for third party companies to \ncreate new applications that alter the SMO processes or policies – for example, based on a \npredictive model of network traffic, or to keep within a certain power consumption constraint. \nSMO is a framework, rather than a solution – an opportunity for flexibility, but also an opportunity to \nrely on existing unchanged practice. As such, it is up to the industry to develop solutions that \nadhere to the framework, even if they differ in implementation details. For example, there is no \nstipulation in the industry specifications that the SMO must be deployed in any particular type of \ncloud environment – public, private or hybrid. \nOpen RAN’s SMO sets out a standard architecture for the management of the disaggregated \ncomponents of the RAN, and the cloud platform that supports them. However, as we have \nhighlighted, the real goal is accelerated innovation. For that, automation is a critical focus for Open \nRAN programs.", "meta": {"ingested_at": 1759756682, "relative_path": "Appledore-TIP-Whitepaper.pdf"}}
{"chunk_id": "86387c09-18c6-41a2-9475-572b7988ee5c-10", "doc_id": "86387c09-18c6-41a2-9475-572b7988ee5c", "source": "Appledore-TIP-Whitepaper.pdf", "file_name": "Appledore-TIP-Whitepaper.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 10, "text": "that supports them. However, as we have highlighted, the real goal is accelerated innovation. For that, automation is a critical focus for Open RAN programs. Innovation Unleashed - Open RAN Orchestration & Management Automation © Telecom Infra Project 2022 www.appledoreresearch.com Page 9 AUTOMATION Operators and aspiring digital service providers need automation, to deliver against multiple business needs: • Support the high volume of changes inherent in cloud-native architectures that scale, heal and optimize themselves. • Significantly reduce time to market, time to restoration and time to (initial) resolution. • Significantly reduce labor costs. Automation, through elimination of labor dependency makes complex services possible at lower scale (for example, bandwidth on demand, scale on threshold, flexible rearrangements to coincide with business needs, and so on.) • Significantly improve network performance, by using automated testing to cover a broader scope of validation, automated deployment and operations management and so prevent human errors. But operators must also see these goals in the context of continuously evolving customer and market requirements. The success of open RAN depends not only on the interoperability of components, and automated management, but also on telcos' ability to rapidly onboard and roll out new network features. Not once or twice in a year, but on a continuous basis. The multiple vendors in an open RAN ecosystem allow operators to tap into more creativity in more areas of the RAN. Vendors are also incentivised to innovate, since operators can bring new or upgraded features into their networks more often and with less overhead than for a conventional RAN upgrade. For these reasons, automation of a continuous cycle of deployment and test (CD/CT) is thus an integral part of the open RAN journey. In this context, automation refers specifically to the automation of: • Software lifecycle management: from accepting delivery of software from third party providers all the way through to live deployment. • In-service lifecycle management: the automatic reconfiguration of software to improve performance in response to failures (self-healing) and to changing traffic pattern and/or network operating environment. • Scaling of software functions to cope with increased (or decreased) demand, or", "meta": {"ingested_at": 1759756682, "relative_path": "Appledore-TIP-Whitepaper.pdf"}}
{"chunk_id": "86387c09-18c6-41a2-9475-572b7988ee5c-11", "doc_id": "86387c09-18c6-41a2-9475-572b7988ee5c", "source": "Appledore-TIP-Whitepaper.pdf", "file_name": "Appledore-TIP-Whitepaper.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 11, "text": "to failures (self-healing) and to changing traffic pattern and/or network operating environment. • Scaling of software functions to cope with increased (or decreased) demand, or to failures (self-healing) and to changing traffic pattern and/or network operating environment. • Scaling of software functions to cope with increased (or decreased) demand, or to accommodate higher-order policies (such as power optimization). The ultimate success of the Open RAN project, across the industry, depends in no small part on the ability to run an accelerated engine of industry innovation. It would be unrealistic to expect today’s Open RAN to match, feature-for-feature, the RAN developed over three or more decades. However, it is also the case that today’s commercial RAN offerings include legacy features which new operators will have no use for.", "meta": {"ingested_at": 1759756682, "relative_path": "Appledore-TIP-Whitepaper.pdf"}}
{"chunk_id": "86387c09-18c6-41a2-9475-572b7988ee5c-12", "doc_id": "86387c09-18c6-41a2-9475-572b7988ee5c", "source": "Appledore-TIP-Whitepaper.pdf", "file_name": "Appledore-TIP-Whitepaper.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 12, "text": "or more decades. However, it is also the case that today’s commercial RAN offerings include legacy features which new operators will have no use for. Innovation Unleashed - Open RAN Orchestration & Management Automation Page 10 www.appledoreresearch.com © Telecom Infra Project 2022 ENABLING THIRD-PARTY INNOVATION One principle of orchestration as an enabler of innovation is that it should be possible for third parties to incorporate telecom services within new applications. For example, the Internet concept of “mashups” – creating entirely new services out of components that already exist, typically APIs, has been the driver of innovation. Mashups are fundamentally the linking of existing capabilities into an end-to-end service, across multiple parties. This is typically accomplished without the active participation of those multiple parties, although they may be compensated for the use of their assets (“for fee” APIs). Telcos have rarely been part of this environment, despite efforts to commercialize APIs in the 90s and 00s. Issued ranged from unattractive pricing to the regional limits of those telcos and more. Today the concept of digital services, enabling, broadly, the Internet of Things looks to be gaining real momentum. The TM Forum, working with media, industry and telecom has created the Open Digital Architecture initiative; and many players are looking at everything from smart manufacturing to smart cities etc. The critical telco piece will be, simply, “network as a service” – exposing things such as soft SIM mobile packages, QoS as needed, MEC/edge capabilities, access service on demand, and service chains. The most popular concept is that of the network slice. The key attribute of these digital service mashups is that they will almost uniformly be driven by third parties. CSPs must expose their capabilities via APIs and innovators in various industry verticals will assembly the ecosystem, including CSP capabilities. Healthcare providers and integrators will create smart health services, while manufacturing integrators will create smart factory systems. The key is not so much for CSPs themselves to be innovators, but to enable and profit from the innovation of others. Success will demand agility, flexibility, automation and smart business models that benefit both sides of the transaction. A key takeaway is that full, hands-off, automation at scale is an", "meta": {"ingested_at": 1759756682, "relative_path": "Appledore-TIP-Whitepaper.pdf"}}
{"chunk_id": "86387c09-18c6-41a2-9475-572b7988ee5c-13", "doc_id": "86387c09-18c6-41a2-9475-572b7988ee5c", "source": "Appledore-TIP-Whitepaper.pdf", "file_name": "Appledore-TIP-Whitepaper.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 13, "text": "flexibility, automation and smart business models that benefit both sides of the transaction. A key takeaway is that full, hands-off, automation at scale is an flexibility, automation and smart business models that benefit both sides of the transaction. A key takeaway is that full, hands-off, automation at scale is an absolute necessity. PEOPLE, PROCESS AND ORGANIZATIONAL CHALLENGES However, success, as always, demands more than technology. Institutional inertia poses a significant challenge and must be overcome. Inertia exists in the form of existing software and existing processes that must be accommodated and ultimately replaced, taking both time and money. Another aspect of inertia is more deeply-rooted – in the body of individual and institutional learning that has occurred over decades. Some hallowed concepts, such as “end-to-end fulfilment within one stack”, “control the details” and “single consistent inventory”, must be un-learned for the cloud- based, disaggregated world. Inertia also exists in organizational structure and process. For example, the separation of fulfilment and assurance into distinct organizations, or business investment processes that assume that a single service must justify an “OSS” investment, and therefore minimize first cost rather than invest in an efficient software factory. In the past, these were reasonable, conscious decisions – when innovation was limited, and service factories were not necessary. Success now demands that we abandon these old assumptions and embrace the proven needs of cloud technology.", "meta": {"ingested_at": 1759756682, "relative_path": "Appledore-TIP-Whitepaper.pdf"}}
{"chunk_id": "86387c09-18c6-41a2-9475-572b7988ee5c-14", "doc_id": "86387c09-18c6-41a2-9475-572b7988ee5c", "source": "Appledore-TIP-Whitepaper.pdf", "file_name": "Appledore-TIP-Whitepaper.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 14, "text": "was limited, and service factories were not necessary. Success now demands that we abandon these old assumptions and embrace the proven needs of cloud technology. Innovation Unleashed - Open RAN Orchestration & Management Automation © Telecom Infra Project 2022 www.appledoreresearch.com Page 11 Lastly, the participation of new partners – potentially many new partners – in the value chain is another counter-intuitive change for an industry that has traditionally been difficult to partner with. Growth now depends on enabling collaboration with innovators who are already closest to the needs of customers. It should by now be clear that operators face fundamental challenges to established ways of working - technical, commercial and organizational. And also that these challenges are addressed by a new focus on orchestration and automation in telecom. But this is not a journey that each operator must make alone. By pooling requirements, knowledge, experience and results with peers, supported by an expanded community of suppliers and stakeholders, operators can make rapid progress with confidence. TELECOM INFRA PROJECT (TIP) TIP is a community of diverse participants that includes hundreds of companies working together to drive infrastructure solutions to advance global connectivity. Participants span the telecom supply chain from service providers and technology suppliers to systems integrators and other connectivity stakeholders. TIP sees a lack of flexibility in current connectivity solutions, exacerbated by a lack of choice of technology providers, as a critical obstacle to service providers’ rollout and upgrading of internet connectivity services. As such, its mission is to accelerate the development of solutions to meet many different market needs, and to foster a more diverse supply chain. “TIP’s mission is to accelerate the development and deployment of open, disaggregated, and standards-based solutions that deliver high quality connectivity the world needs, now and in the decades to come.” TIP is complementary to the work of standards groups, providing a feedback loop based on practical attempts to apply the standards, in development, test and integration, both against CSP-defined requirements, and vendor products (and combinations of vendor products). Experience gained in the field thus shapes changes to the standards, so as to make them more", "meta": {"ingested_at": 1759756682, "relative_path": "Appledore-TIP-Whitepaper.pdf"}}
{"chunk_id": "86387c09-18c6-41a2-9475-572b7988ee5c-15", "doc_id": "86387c09-18c6-41a2-9475-572b7988ee5c", "source": "Appledore-TIP-Whitepaper.pdf", "file_name": "Appledore-TIP-Whitepaper.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 15, "text": "and vendor products (and combinations of vendor products). Experience gained in the field thus shapes changes to the standards, so as to make them more and vendor products (and combinations of vendor products). Experience gained in the field thus shapes changes to the standards, so as to make them more likely to be adopted.", "meta": {"ingested_at": 1759756682, "relative_path": "Appledore-TIP-Whitepaper.pdf"}}
{"chunk_id": "86387c09-18c6-41a2-9475-572b7988ee5c-16", "doc_id": "86387c09-18c6-41a2-9475-572b7988ee5c", "source": "Appledore-TIP-Whitepaper.pdf", "file_name": "Appledore-TIP-Whitepaper.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 16, "text": "combinations of vendor products). Experience gained in the field thus shapes changes to the standards, so as to make them more likely to be adopted. Innovation Unleashed - Open RAN Orchestration & Management Automation \nPage 12 \nwww.appledoreresearch.com \n© Telecom Infra Project 2022 \n \nExplicitly not a standards body, TIP instead acts as a productization body. As illustrated in Figure 3: \nTIP accelerates commercial solution development (Source: TIP) it aims to accelerate the process for \ndeveloping and deploying new solutions, using components based on open principles. It does this \nby taking emerging standards or architectures and applying them in real world contexts. The \nfindings and experiences are fed back to the relevant standards groups to both validate and \nimprove deployability. \nTIP champions the use of open principles and standards, and disaggregated architectures to reduce \nthe cost of deploying and operating real world solutions. Open standards-based products and \narchitectures allow many more suppliers to enter the market, since they effectively make decades of \naccumulated industry knowledge available at no cost. Anywhere that it may be difficult or \nimpossible to access highly specialized knowledge and skills, TIP’s work enables sophisticated \nproducts and solutions to be procured and deployed by following pre-packaged, pre-validated \n“blueprints”. \nThrough its end-to-end process, TIP provides a route for turning requirements into commercial \nrealities while reducing industry fragmentation, enabling a shorter time to market, and accelerating \ncommercial deployments. \nUltimately, through collaboration, sharing of requirements and learnings, TIP participants - both \noperators and vendors – can reduce the cost, complexity, risk and timeframe to develop, procure \nand deploy solutions in the field. \nFigure 3: TIP accelerates commercial solution development (Source: TIP)", "meta": {"ingested_at": 1759756682, "relative_path": "Appledore-TIP-Whitepaper.pdf"}}
{"chunk_id": "86387c09-18c6-41a2-9475-572b7988ee5c-17", "doc_id": "86387c09-18c6-41a2-9475-572b7988ee5c", "source": "Appledore-TIP-Whitepaper.pdf", "file_name": "Appledore-TIP-Whitepaper.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 17, "text": "reduce the cost, complexity, risk and timeframe to develop, procure and deploy solutions in the field. Figure 3: TIP accelerates commercial solution development (Source: TIP) Innovation Unleashed - Open RAN Orchestration & Management Automation © Telecom Infra Project 2022 www.appledoreresearch.com Page 13 TIP, Orchestration & Automation In the journey to widespread adoption of open RAN, TIP is playing a key role, not limited to validation. This is especially true in the area of automation and orchestration. ROMA is TIP’s Open RAN Orchestration and Management Automation program. As with other TIP programs, its remit is to define a reference set of common industry requirements pooled from multiple operator participants, and to define an associated set of conformance tests. ROMA’s activity includes: • Developing a common set of use cases for OpenRAN lifecycle management automation and orchestration that are agreed across multiple MNO and OpenRAN ecosystem members • Developing Technical Requirements on products and solutions that support the identified use cases, including interfaces and data models • Facilitating product and solution development through lab testing, field trials, participating TIP Plugfest and badging on TIP Exchange etc. • Supporting large scale OpenRAN deployment with lifecycle management automation, including Continuous Deployment and Continuous Testing (CD/CT) frameworks and tool sets. These give suppliers a way to reduce the timescale and risk in developing solutions (since baseline industry needs are already defined) and enable potential buyers to reduce the effort in validating solutions. The result is an accelerated development and deployment of viable solutions. At the time of writing, ROMA has over forty participating companies and CSPs. As such, this represents the largest collaborative effort in the industry targeted at open RAN Orchestration. “ROMA is addressing the need for the industry to innovate in OpenRAN automation, in order to optimize the processes of integration, testing, deployment, operation and maintenance for OpenRAN networks.” - Juan Carlos Garcia, Telefónica’s SVP Technology, Innovation and Ecosystem and TIP’s Board Director. The initial set of ROMA technical requirements were published in the latest TIP OpenRAN 2.1 Requirements document. The Reference Architecture for ROMA is already in OpenRAN ROMA 2.0. The first set of ROMA test cases, including standardized tests", "meta": {"ingested_at": 1759756682, "relative_path": "Appledore-TIP-Whitepaper.pdf"}}
{"chunk_id": "86387c09-18c6-41a2-9475-572b7988ee5c-18", "doc_id": "86387c09-18c6-41a2-9475-572b7988ee5c", "source": "Appledore-TIP-Whitepaper.pdf", "file_name": "Appledore-TIP-Whitepaper.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 18, "text": "OpenRAN 2.1 Requirements document. The Reference Architecture for ROMA is already in OpenRAN ROMA 2.0. The first set of ROMA test cases, including standardized tests OpenRAN 2.1 Requirements document. The Reference Architecture for ROMA is already in OpenRAN ROMA 2.0. The first set of ROMA test cases, including standardized tests for end-to-end service provisioning including fault and performance management, as well as backup and restore, have been defined. In July 2022, TIP announced a new test environment in the TIP Community Lab at Menlo Park specifically for ROMA testing and validation. This is the first multi-operator network environment in which vendors can demonstrate, test and validate their SMO and CD/CT products in a containerized OpenRAN environment. By consolidating test results and making them available to Service Providers, Systems Integrators and equipment vendors, TIP aims to accelerate the adoption of OpenRAN. Aarna Networks, Amdocs, Atrinet, Capgemini and Tech Mahindra are actively participating. Vodafone, co-chair of TIP OpenRAN ROMA, has said that the new ROMA-focused Lab provides “a solid foundation for us and other MNOs to validate and expand OpenRAN Management, Orchestration and Automation use cases.”", "meta": {"ingested_at": 1759756682, "relative_path": "Appledore-TIP-Whitepaper.pdf"}}
{"chunk_id": "86387c09-18c6-41a2-9475-572b7988ee5c-19", "doc_id": "86387c09-18c6-41a2-9475-572b7988ee5c", "source": "Appledore-TIP-Whitepaper.pdf", "file_name": "Appledore-TIP-Whitepaper.pdf", "file_ext": ".pdf", "role": "public", "chunk_index": 19, "text": "that the new ROMA-focused Lab provides “a solid foundation for us and other MNOs to validate and expand OpenRAN Management, Orchestration and Automation use cases.” Innovation Unleashed - Open RAN Orchestration & Management Automation \nPage 14 \nwww.appledoreresearch.com \n© Telecom Infra Project 2022 \n \nCONCLUSION \nThe true potential of Open RAN requires changes to more than just the RAN. Orchestration and \nautomation are the key capabilities that will unlock its potential – especially for innovation – but \nsuccessful implementations require organizational as well as technology change. \nThe work of the Telecom Infra Project is contributing to rapid learning and accelerated availability of \nsolutions that will meet operators’ – and wider industry – needs. Industry collaboration is the best \ndefense against unfulfilled promises.\n\nIn collaboration with \n \nInsight and analysis for telecom transformation. \n @AppledoreVision \n Appledore Research \nwww.appledoreresearch.com \ninfo@appledorerg.com \n+1 603 969 2125 \n44 Summer Street Dover, NH. 03820, USA", "meta": {"ingested_at": 1759756682, "relative_path": "Appledore-TIP-Whitepaper.pdf"}}
